{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Corelight",
    "dataSource.vendor": "Corelight",
    "class_uid": 4001,
    "category_uid": 4,
    "severity_id": 1,
    "severity": "Informational",
    "class_name": "Network Activity",
    "category_name": "Network Activity",
    "metadata.product.name": "Zeek",
    "metadata.product.vendor_name": "Zeek",
    "metadata.version": "1.1.0",
    "metadata.log_name": "conn",
    "app_name": "Zeek"
  },
  formats: [
    {
      format: "${parse=dottedJson}$",
      repeat: true
    }
  ],
  mappings: {
    version: 0,
    mappings: [
        {
          predicate: "true",
          copies: [
            {inputs: ["ts"], output: "time", type: "string"}
            {inputs: ["uid"], output: "uuid", type: "string"}
            {inputs: ["id.resp_h"], output: "dst_endpoint.ip", type: "string"}
            {inputs: ["id.orig_p"], output: "src_endpoint.port", type: "string"}
          ]
          renames: [
            {inputs: ["ts"], output: "timestamp", type: "string"}    
            {inputs: ["uid"], output: "metadata.uid", type: "string"}  
            {inputs: ["id.orig_h"], output: "src_endpoint.ip", type: "string"}
            {inputs: ["id.resp_p"], output: "dst_endpoint.port", type: "string"}
            {inputs: ["proto"], output: "network_connection_info.protocol_name", type: "string"}
            {inputs: ["service"], output: "unmapped.service", type: "string"}
            {inputs: ["orig_bytes"], output: "traffic.bytes_out", type: "string"}
            {inputs: ["resp_bytes"], output: "traffic.bytes_in", type: "string"}
            {inputs: ["local_orig"], output: "unmapped.local_orig", type: "string"}
            {inputs: ["local_resp"], output: "unmapped.local_resp", type: "string"}
            {inputs: ["missed_bytes"], output: "unmapped.missed_bytes", type: "string"}
            {inputs: ["history"], output: "unmapped.history", type: "string"}
            {inputs: ["orig_pkts"], output: "traffic.packets_out", type: "string"}
            {inputs: ["orig_ip_bytes"], output: "unmapped.orig_ip_bytes", type: "string"}
            {inputs: ["resp_pkts"], output: "traffic.packets_in", type: "string"}
            {inputs: ["resp_ip_bytes"], output: "unmapped.resp_ip_bytes", type: "string"}
            {inputs: ["tunnel_parents"], output: "unmapped.tunnel_parents", type: "string"}
            {inputs: ["orig_l2_addr"], output: "src_endpoint.mac", type: "string"}
            {inputs: ["resp_l2_addr"], output: "dst_endpoint.mac", type: "string"}
            {inputs: ["vlan"], output: "dst_endpoint.vlan_uid", type: "string"}
            {inputs: ["inner_vlan"], output: "src_endpoint.vlan_uid", type: "string"}
          ],
          constants: [
            { value: 4, field: "activity_id", predicate: "conn_state = 'S0'"}
            { value: 4, field: "activity_id", predicate: "conn_state = 'S2'"}
            { value: 4, field: "activity_id", predicate: "conn_state = 'S3'"}
            { value: "Fail", field: "activity_name", predicate: "conn_state = 'S0'"}
            { value: "Fail", field: "activity_name", predicate: "conn_state = 'S2'"}
            { value: "Fail", field: "activity_name", predicate: "conn_state = 'S3'"}
            { value: 400104, field: "type_uid", predicate: "conn_state = 'S0'"}
            { value: 400104, field: "type_uid", predicate: "conn_state = 'S2'"}
            { value: 400104, field: "type_uid", predicate: "conn_state = 'S3'"}
            { value: 1, field: "activity_id", predicate: "conn_state = 'S1'"}
            { value: "Open", field: "activity_name", predicate: "conn_state = 'S1'"}
            { value: 400101, field: "type_uid", predicate: "conn_state = 'S1'"}
            { value: 6, field: "activity_id", predicate: "conn_state = 'SF'"}
            { value: "Traffic", field: "activity_name", predicate: "conn_state = 'SF'"}
            { value: 400106, field: "type_uid", predicate: "conn_state = 'SF'"}
            { value: 5, field: "activity_id", predicate: "conn_state = 'REJ'"}
            { value: "Refuse", field: "activity_name", predicate: "conn_state = 'REJ'"}
            { value: 400105, field: "type_uid", predicate: "conn_state = 'REJ'"}
            { value: 3, field: "activity_id", predicate: "conn_state = 'RSTO'"}
            { value: 3, field: "activity_id", predicate: "conn_state = 'RSTR'"}
            { value: 3, field: "activity_id", predicate: "conn_state = 'RSTOS0'"}
            { value: 3, field: "activity_id", predicate: "conn_state = 'RSTRH'"}
            { value: "Reset", field: "activity_name", predicate: "conn_state = 'RSTO'"}
            { value: "Reset", field: "activity_name", predicate: "conn_state = 'RSTR'"}
            { value: "Reset", field: "activity_name", predicate: "conn_state = 'RSTOS0'"}
            { value: "Reset", field: "activity_name", predicate: "conn_state = 'RSTRH'"}
            { value: 400103, field: "type_uid", predicate: "conn_state = 'RSTO'"}
            { value: 400103, field: "type_uid", predicate: "conn_state = 'RSTR'"}
            { value: 400103, field: "type_uid", predicate: "conn_state = 'RSTOS0'"}
            { value: 400103, field: "type_uid", predicate: "conn_state = 'RSTRH'"}
            { value: 0, field: "activity_id", predicate: "conn_state = 'SH'"}
            { value: 0, field: "activity_id", predicate: "conn_state = 'SHR'"}
            { value: "Unknown", field: "activity_name", predicate: "conn_state = 'SH'"}
            { value: "Unknown", field: "activity_name", predicate: "conn_state = 'SHR'"}
            { value: 400100, field: "type_uid", predicate: "conn_state = 'SH'"}
            { value: 400100, field: "type_uid", predicate: "conn_state = 'SHR'"}
            { value: 0, field: "activity_id", predicate: "conn_state = 'OTH'"}
            { value: "Other", field: "activity_name", predicate: "conn_state = 'OTH'"}
            { value: 400199, field: "type_uid", predicate: "conn_state = 'OTH'"}
          ]
        },
    ]
  }
}
