{
    attributes: {
      "metadata.product.vendor_name": "AWS",
      "metadata.version": "1.2.0",
      "dataSource.category": "security",
      "dataSource.name": "AWS RDS",
      "dataSource.vendor": "AWS"
    },
  
    patterns: {
      ts_pattern: "\\d{4}-\\d{2}-\\d{2} \\d{2}:\\d{2}:\\d{2}(?:\\.\\d{3})? (?:GMT|UTC)"
    },
  
    lineGroupers: [
      {
        start: "^# User",
        haltBefore: "^# (User|Time)"
      }
    ],
  
    formats: [
      {
        id: "mySqlErrorLog",
        format: "$metadata.original_time$ $query_info.uid$ \\[$severity$\\] \\[$metadata.event_code$\\] \\[$metadata.log_provider$\\] $status_detail$",
        halt: true,
        attributes: {
          activity_id: 99,
          activity_name: "Error",
          category_uid: 6,
          category_name: "Application Activity",
          class_uid: 6005,
          class_name: "Datastore Activity",
          "event.type": "Error",
          type_uid: 600599,
          type_name: "Datastore Activity: Other"
        },
      },
      {
        id: "mySqlGeneralLog",
        format: "$query_info.query_time$ $query_info.uid=number$ $activity_name$ $query_info.query_string{parse=sqlToSignature}$",
        halt: true,
        attributes: {
          category_uid: 6,
          category_name: "Application Activity",
          class_uid: 6005,
          class_name: "Datastore Activity",
          severity: "Informational",
          severity_id: 1
        }
      },
      {
        id: "postgresqlLog",
        format: "$metadata.original_time=ts_pattern$:$src_endpoint.hostname$:$actor.user.name$@$database.name$:\\[$actor.process.uid$\\]:$metadata.log_level$:\\s+$status_detail$",
        halt: true,
        attributes: {
          activity_id: 99,
          category_uid: 6,
          category_name: "Application Activity",
          class_uid: 6005,
          class_name: "Datastore Activity",
          type_uid: 600599,
          type_name: "Datastore Activity: Other"
        }
      },
      {
        id: "postgresqlLog",
        format: "$metadata.original_time=ts_pattern$ \\[$actor.process.uid$\\] $metadata.log_level$:\\s+$status_detail$",
        halt: true,
        attributes: {
          activity_id: 99,
          category_uid: 6,
          category_name: "Application Activity",
          class_uid: 6005,
          class_name: "Datastore Activity",
          type_uid: 600599,
          type_name: "Datastore Activity: Other"
        }
      }
    ]
    mappings: {
      version: 0,
      mappings: [
        {
          predicate: "mySqlErrorLog='true'",
          constants: [
            { value: "Medium", field: "severity", predicate: "severity = 'WARNING'"}
            { value: 3, field: "severity_id", predicate: "severity = 'WARNING'"}
            { value: "Fatal", field: "severity", predicate: "severity = 'ERROR'"}
            { value: 6, field: "severity_id", predicate: "severity = 'ERROR'"}
            { value: "Informational", field: "severity", predicate: "severity = 'SYSTEM'"}
            { value: 1, field: "severity_id", predicate: "severity = 'SYSTEM'"}
            { value: "Informational", field: "severity", predicate: "severity = 'NOTE'"}
            { value: 1, field: "severity_id", predicate: "severity = 'NOTE'"}
            { value: "Informational", field: "severity", predicate: "severity = 'INFORMATIONAL'"}
            { value: 1, field: "severity_id", predicate: "severity = 'INFORMATIONAL'"}
          ]
        },
        {
          predicate: "mySqlGeneralLog='true'",
          copies: [
            { inputs: [ "activity_name" ], output: "event.type", type: "string"}
          ],
          constants: [
            { value: 4, field: "activity_id", predicate: "activity_name = 'Query'"}
            { value: 600504, field: "type_uid", predicate: "activity_name = 'Query'"}
            { value: "Datastore Activity: Query", field: "type_name", predicate: "activity_name = 'Query'"}
            { value: 3, field: "activity_id", predicate: "activity_name = 'Connect'"}
            { value: 600503, field: "type_uid", predicate: "activity_name = 'Connect'"}
            { value: "Datastore Activity: Connect", field: "type_name", predicate: "activity_name = 'Connect'"}
            { value: 99, field: "activity_id", predicate: "activity_name = 'Statistics'"}
            { value: 600599, field: "type_uid", predicate: "activity_name = 'Statistics'"}
            { value: "Datastore Activity: Statistics", field: "type_name", predicate: "activity_name = 'Statistics'"}
            { value: 99, field: "activity_id", predicate: "activity_name = 'Quit'"}
            { value: 600599, field: "type_uid", predicate: "activity_name = 'Quit'"}
            { value: "Datastore Activity: Quit", field: "type_name", predicate: "activity_name = 'Quit'"}
          ]
        },
        {
          predicate: "postgresqlLog='true'",
          copies: [
            { inputs: [ "metadata.log_level" ], output: "activity_name", type: "string"}
            { inputs: [ "metadata.log_level" ], output: "event.type", type: "string"}
          ],
          constants: [
            { value: "Informational", field: "severity", predicate: "metadata.log_level = 'INFO' or 'LOG' or 'DEBUG1' or 'DEBUG2' or 'DEBUG3' or 'DEBUG4' or 'DEBUG5'"}
            { value: 1, field: "severity_id", predicate: "metadata.log_level = 'INFO' or 'LOG' or 'DEBUG1' or 'DEBUG2' or 'DEBUG3' or 'DEBUG4' or 'DEBUG5'"}
            { value: "Low", field: "severity", predicate: "metadata.log_level = 'NOTICE'"}
            { value: 2, field: "severity_id", predicate: "metadata.log_level = 'NOTICE'"}
            { value: "Medium", field: "severity", predicate: "metadata.log_level = 'WARNING'"}
            { value: 3, field: "severity_id", predicate: "metadata.log_level = 'WARNING'"}
            { value: "Critical", field: "severity", predicate: "metadata.log_level = 'FATAL'"}
            { value: 5, field: "severity_id", predicate: "metadata.log_level = 'FATAL'"}
            { value: "Fatal", field: "severity", predicate: "metadata.log_level = 'PANIC'"}
            { value: 6, field: "severity_id", predicate: "metadata.log_level = 'PANIC'"}
          ]
        },
      ]
    }
  }
  