{
  attributes: {
    "dataSource.category": "security",
    "dataSource.name": "Corelight",
    "dataSource.vendor": "Corelight",
    "class_uid": 4001,
    "category_uid": 4,
    "severity_id": 1,
    "severity": "Informational",
    "class_name": "Network Activity",
    "category_name": "Network Activity",
    "metadata.product.name": "Zeek",
    "metadata.product.vendor_name": "Corelight",
    "metadata.version": "1.1.0",
    "metadata.log_name": "ssl",
    "app_name": "Zeek"
  },
  formats: [
    {
      format: "${parse=dottedJson}$",
      repeat: true
    }
  ],
  mappings: {
    version: 0,
    mappings: [
      {
        predicate: "true",
        copies: [
          {inputs: ["ts"], output: "time", type: "string"}
          {inputs: ["uid"], output: "uuid", type: "string"}
          {inputs: ["id.resp_h"], output: "dst_endpoint.ip", type: "string"}
          {inputs: ["id.orig_p"], output: "src_endpoint.port", type: "string"}
        ]
        renames: [
          {inputs: ["ts"], output: "timestamp", type: "string"}    
          {inputs: ["uid"], output: "metadata.uid", type: "string"}  
          {inputs: ["id.orig_h"], output: "src_endpoint.ip", type: "string"}
          {inputs: ["id.resp_p"], output: "dst_endpoint.port", type: "string"}
          {inputs: ["version"], output: "tls.version", type: "string"}
          {inputs: ["cipher"], output: "tls.cipher", type: "string"}
          {inputs: ["curve"], output: "unmapped.curve", type: "string"}
          {inputs: ["server_name"], output: "tls.sni", type: "string"}
          {inputs: ["resumed"], output: "unmapped.resumed", type: "string"}
          {inputs: ["established"], output: "activity_id", type: "string"}
        ],
        constants: [
          { value: 1, field: "activity_id", predicate: "established = 'true'"}
          { value: "1", field: "tls.certificate.subject", predicate: "subject = 'true'"}
          { value: "1", field: "tls.certificate.issuer", predicate: "issuer = 'true'"}
          { value: "1", field: "tls.certificate.fingerprints[0].value", predicate: "cert_chain_fps = 'true'"}
          { value: "1", field: "unmapped.next_protocol", predicate: "next_protocol = 'true'"}
          { value: "1", field: "tls.ja3_hash.value", predicate: "ja3 = 'true'"}
          { value: "1", field: "tls.ja3s_hash.value", predicate: "ja3 = 'true'"}
          { value: 99, field: "tls.certificate.fingerprints[0].algorithm_id"}
          { value: 1, field: "tls.ja3_hash.algorithm_id"}
          { value: 1, field: "tls.ja3s_hash.algorithm_id"}
        ]
      },
    ]
  }
}
