{
  attributes: {
      "dataSource.category": "security",
      "dataSource.name": "Prisma Access",
      "dataSource.vendor": "Palo Alto Networks",
      "metadata.version":"1.0.0"
  },
  patterns: {
      url_category_list_pattern: "(\".*\")|[^,]+",
  }
  formats: [
      {   
          attributes: {
              "metadata.log_name": "TRAFFIC"
              "class_uid": "4001",
              "category_uid": "4",
              "severity_id": "0",
              "class_name": "Network Activity",
              "category_name": "Network Activity",
              "metadata.product.name": "Prisma Access",
              "metadata.product.vendor_name": "Palo Alto Networks",
          },
          format: "$metadata.processed_time$ $unmapped.header$ .* $metadata.logged_time$,$device.hw_info.serial_number$,TRAFFIC,$unmapped.sub_type$,$metadata.product.version$,$metadata.original_time$,$src_endpoint.ip$,$dst_endpoint.ip$,.*,$dst_endpoint.intermediate_ips$,$unmapped.rule_matchede$,$actor.user.name$,$unmapped.dest_user$,$app_name$,$unmapped.vsys$,$unmapped.from_zone$,$unmapped.to_zone$,$unmapped.inbound_if$,$unmapped.outbound_if$,$metadata.log_provider$,$actor.session.uid$,$count$,$src_endpoint.port$,$dst_endpoint.port$,$unmapped.src_nat_port$,$unmapped.dst_nat_port$,$connection_info.protocol_name$,$unmapped.action$,$traffic.bytes$,$traffic.bytes_in$,$traffic.bytes_out$,$traffic.packets$,$actor.session.created_time$,$duration$,$unmapped.url_category_value$,$metadata.sequence$,$src_endpoint.location.region$,$dst_endpoint.location.region$,$traffic.packets_out$,$traffic.packets_in$,$unmapped.session_end_reason_value$,$unmapped.dg_hier_level_1$,$unmapped.dg_hier_level_2$,$unmapped.dg_hier_level_3$,$unmapped.dg_hier_level_4$,$unmapped.vsys_name$,$device.name$,$unmapped.action_source$,$unmapped.src_uuid$,$unmapped.dst_uuid$,$device.imsi$,$device.imei$,$unmapped.parent_session_id$,$unmapped.parent_start_time$,$unmapped.tunnel_type$,$unmapped.ep_assoc_id$,$unmapped.chunks$,$unmapped.chunks_out$,$unmapped.chunks_in$,$unmapped.rule_matched_uuid$,$unmapped.http2_connection$,$unmapped.link_change_count$,$actor.authorizations.policy.uid$,$unmapped.link_switches$,$unmapped.sdwan_cluster$,$unmapped.sdwan_device_type$,$unmapped.sdwan_cluster_type$,$unmapped.sdwan_site$,$actor.user.groups$,.*,$unmapped.src_category$,$unmapped.src_profile$,$unmapped.src_model$,$unmapped.src_vendor$,$unmapped.src_osfamily$,$unmapped.src_osversion$,$src_endpoint.hostname$,$src_endpoint.mac$,$unmapped.dst_category$,$unmapped.dst_profile$,$unmapped.dst_model$,$unmapped.dst_vendor$,$unmapped.dst_osfamily$,$unmapped.dst_osversion$,$dst_endpoint.hostname$,$dst_endpoint.mac$,$unmapped.container_id$,$unmapped.pod_namespace$,$unmapped.pod_name$,$unmapped.src_edl$,$unmapped.dst_edl$,$device.uid$,$unmapped.serial_number$,$unmapped.src_dag$,$unmapped.dst_dag$,$unmapped.session_owner$,$time$,$unmapped.nsdsai_sst$,$unmapped.nsdsai_sd$",
          halt: true,
          rewrites: [
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_id",
                  match:   "^start$",
                  replace: "1"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_id",
                  match:   "^end$",
                  replace: "2"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_id",
                  match:   "^drop$",
                  replace: "4"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_id",
                  match:   "^deny$",
                  replace: "5"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_name",
                  match:   "^start$",
                  replace: "Open"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_name",
                  match:   "^end$",
                  replace: "Close"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_name",
                  match:   "^drop$",
                  replace: "Fail"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "activity_name",
                  match:   "^deny$",
                  replace: "Refuse"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "event.type",
                  match:   "^start$",
                  replace: "Open"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "event.type",
                  match:   "^end$",
                  replace: "Close"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "event.type",
                  match:   "^drop$",
                  replace: "Fail"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "event.type",
                  match:   "^deny$",
                  replace: "Refuse"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_uid",
                  match:   "^start$",
                  replace: "400101"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_uid",
                  match:   "^end$",
                  replace: "400102"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_uid",
                  match:   "^drop$",
                  replace: "400104"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_uid",
                  match:   "^deny$",
                  replace: "400105"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_name",
                  match:   "^start$",
                  replace: "Network Activity: Open"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_name",
                  match:   "^end$",
                  replace: "Network Activity: Close"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_name",
                  match:   "^drop$",
                  replace: "Network Activity: Fail"
              },
              {
                  input:   "unmapped.sub_type",
                  output:  "type_name",
                  match:   "^deny$",
                  replace: "Network Activity: Refuse"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^allow$",
                  replace: "1"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^deny$",
                  replace: "2"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^(?!allow|deny$).*",
                  replace: "99"
              },
              {
                  input:   "message",
                  output:  "src_endpoint.intermediate_ips",
                  match:   "(.*?) (.*?) (.*?) (.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?).*",
                  replace: "\\[\"$12\"\\, \"$73\"\\]"
              },
              {
                  input:   "message",
                  output:  "observables",
                  match:   "(.*?) (.*?) (.*?) (.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?).*",
                  replace: "\\[\\{\"type_id\"\\: \"1\"\\, \"type\"\\: \"Hostname\"\\, \"name\"\\: \"src_endpoint.hostname\"\\, \"value\"\\: \"$80\"\\}\\, \\{\"type_id\"\\: \"1\"\\, \"type\"\\: \"Hostname\"\\, \"name\"\\: \"dst_endpoint.hostname\"\\, \"value\"\\: \"$88\"\\}\\, \\{\"type_id\"\\: \"2\"\\, \"type\"\\: \"IP Address\"\\, \"name\"\\: \"src_endpoint.ip\"\\, \"value\"\\: \"$10\"\\}\\, \\{\"type_id\"\\: \"2\"\\, \"type\"\\: \"IP Address\"\\, \"name\"\\: \"dst_endpoint.ip\"\\, \"value\"\\: \"$11\"\\}\\, \\{\"type_id\"\\: \"3\"\\, \"type\"\\: \"MAC Address\"\\, \"name\"\\: \"src_endpoint.mac\"\\, \"value\"\\: \"$81\"\\}\\, \\{\"type_id\"\\: \"3\"\\, \"type\"\\: \"MAC Address\"\\, \"name\"\\: \"dst_endpoint.mac\"\\, \"value\"\\: \"$89\"\\}\\, \\{\"type_id\"\\: \"4\"\\, \"type\"\\: \"User Name\"\\, \"name\"\\: \"actor.user.name\"\\, \"value\"\\: \"$15\"\\}\\, \\{\"type_id\"\\: \"4\"\\, \"type\"\\: \"User Name\"\\, \"name\"\\: \"unmapped.dest_user\"\\, \"value\"\\: \"$16\"\\}\\]"
              },
              {
                  input:   "dst_endpoint.intermediate_ips",
                  output:  "dst_endpoint.intermediate_ips",
                  match:   ".*",
                  replace: "\\[\"$0\"\\]"
              },
              {
                  input:   "actor.authorizations.policy.uid",
                  output:  "actor.authorizations",
                  match:   ".*",
                  replace: "\\[\\{\"policy\"\\: \\{\"uid\"\\: \"$0\"\\}\\}\\]"
              },
          ]
      },
      {
          attributes: {
              "metadata.log_name": "THREAT",
              "analytic.type_id": "1",
              "finding.title": "url",
              "class_uid": "2001",
              "activity_id": "99",
              "activity_name": "url",
              "event.type": "url",
              "severity_id": "99",
              "category_uid": "2",
              "type_uid": "200199",
              "type_name": "Security Finding: Other"
              "class_name": "Security Finding",
              "category_name": "Findings",
              "metadata.product.name": "Prisma Access",
              "metadata.product.vendor_name": "Palo Alto Networks",
          },
          format: "$metadata.processed_time$ $unmapped.header$ .* $metadata.logged_time$,$unmapped.serial$,THREAT,url,$metadata.product.version$,$metadata.original_time$,.*,.*,.*,.*,$unmapped.rule_matched$,.*,.*,$unmapped.app$,$unmapped.vsys$,$unmapped.from_zone$,$unmapped.to_zone$,$unmapped.inbound_if$,$unmapped.outbound_if$,$metadata.log_provider$,$unmapped.session_id$,$count$,.*,.*,.*,.*,$unmapped.protocol_value$,$unmapped.action$,$unmapped.misc$,$unmapped.category$,$unmapped.severity$,$unmapped.direction$,$metadata.sequence$,.*,.*,$unmapped.content_type$,$unmapped.pcap_id$,.*,.*,.*,.*,$unmapped.dg_hier_level_1$,$unmapped.dg_hier_level_2$,$unmapped.dg_hier_level_3$,$unmapped.dg_hier_level_4$,$unmapped.vsys_name$,.*,$unmapped.src_uuid$,$unmapped.dst_uuid$,.*,$unmapped.tunnelid_imsi$,$unmapped.monitor_tag_imei$,$unmapped.parent_session_id$,$unmapped.parent_start_time$,$unmapped.tunnel_type$,$analytic.category$,$unmapped.ep_assoc_id$,$unmapped.ppid$,$unmapped.http_headers$,$unmapped.url_category_list=url_category_list_pattern$,$analytic.uid$,$unmapped.http2_connection$,.*,.*,$unmapped.src_category$,$unmapped.src_profile$,$unmapped.src_model$,$unmapped.src_vendor$,$unmapped.src_osfamily$,$unmapped.src_osversion$,.*,.*,$unmapped.dst_category$,$unmapped.dst_profile$,$unmapped.dst_model$,$unmapped.dst_vendor$,$unmapped.dst_osfamily$,$unmapped.dst_osversion$,.*,.*,$unmapped.container_id$,$unmapped.pod_namespace$,$unmapped.pod_name$,$unmapped.src_edl$,$unmapped.dst_edl$,$unmapped.hostid$,$unmapped.serialnumber$,$unmapped.src_dag$,$unmapped.dst_dag$,$time$,$unmapped.reason$"
          halt: true,
          rewrites: [
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Critical$",
                  replace: "5"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^High$",
                  replace: "4"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Medium$",
                  replace: "3"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Low$",
                  replace: "2"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Informational$",
                  replace: "1"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^allow$",
                  replace: "1"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^deny$",
                  replace: "2"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^(?!allow|deny$).*",
                  replace: "99"
              },
              {
                  input:   "message",
                  output:  "resources",
                  match:   "(.*?) (.*?) (.*?) (.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?)(.*?).*",
                  replace: "\\[\\{\"owner\"\\: \\{\"name\"\\: \"$15\"\\, \"groups\": \\[\\{\"name\"\\: \"$66\"\\}\\]\\}\\, \"data\"\\: \\{\"src_ip\"\\: \"$10\"\\, \"dst_ip\"\\: \"$11\"\\, \"src_nat_ip\"\\: \"$12\"\\, \"dst_nat_ip\"\\: \"$13\"\\, \"dest_user\"\\: \"$16\"\\, \"src_port\"\\: \"$26\"\\, \"dst_port\"\\: \"$27\"\\, \"src_nat_port\"\\: \"$28\"\\, \"dst_nat_port\"\\: \"$29\"\\, \"src_country\"\\: \"$37\"\\, \"dst_country\"\\: \"$38\"\\, \"url_idx\"\\: \"$41\"\\, \"user_agent\"\\: \"$42\"\\, \"xff\"\\: \"$43\"\\, \"referrer\"\\: \"$44\"\\, \"device_name\"\\: \"$50\"\\, \"http_method\"\\: \"$53\"\\, \"xff_ip\"\\: \"$67\"\\, \"src_host\"\\: \"$74\"\\, \"src_mac\"\\: \"$75\"\\, \"dst_host\"\\: \"$82\"\\, \"dst_mac\"\\: \"$83\"\\}\\}\\]"
              },
          ]
      },
      {
          attributes: {
              "metadata.log_name": "THREAT",
              "analytic.type_id": "1",
              "finding.title": "spyware",
              "class_uid": "2001",
              "activity_id": "99",
              "activity_name": "spyware",
              "event.type": "spyware",
              "category_uid": "2",
              "type_uid": "200199",
              "severity_id": "99",
              "class_name": "Security Finding",
              "type_name": "Security Finding: Other"
              "category_name": "Findings",
              "metadata.product.name": "Prisma Access",
              "metadata.product.vendor_name": "Palo Alto Networks",
          },
          format: "$metadata.processed_time$ $unmapped.header$ .* $metadata.logged_time$,$unmapped.serial$,THREAT,spyware,$metadata.product.version$,$metadata.original_time$,.*,.*,.*,.*,$unmapped.rule_matched$,.*,.*,$unmapped.app$,$unmapped.vsys$,$unmapped.from_zone$,$unmapped.to_zone$,$unmapped.inbound_if$,$unmapped.outbound_if$,$metadata.log_provider$,$unmapped.session_id$,$count$,.*,.*,.*,.*,$unmapped.protocol_value$,$unmapped.action$,$unmapped.misc$,$unmapped.category$,$unmapped.severity$,$unmapped.direction$,$metadata.sequence$,.*,.*,.*,.*,.*,.*,.*,.*,.*,.*,.*,$unmapped.dg_hier_level_1$,$unmapped.dg_hier_level_2$,$unmapped.dg_hier_level_3$,$unmapped.dg_hier_level_4$,$unmapped.vsys_name$,.*,$unmapped.src_uuid$,$unmapped.dst_uuid$,$unmapped.tunnelid_imsi$,$unmapped.monitor_tag_imei$,$unmapped.parent_session_id$,$unmapped.parent_start_time$,$unmapped.tunnel_type$,$analytic.category$,$unmapped.ep_assoc_id$,$unmapped.ppid$,$unmapped.http_headers$,$unmapped.url_category_list=url_category_list_pattern$,$analytic.uid$,$unmapped.http2_connection$,.*,.*,$unmapped.src_category$,$unmapped.src_profile$,$unmapped.src_model$,$unmapped.src_vendor$,$unmapped.src_osfamily$,$unmapped.src_osversion$,.*,.*,$unmapped.dst_category$,$unmapped.dst_profile$,$unmapped.dst_model$,$unmapped.dst_vendor$,$unmapped.dst_osfamily$,$unmapped.dst_osversion$,.*,.*,$unmapped.container_id$,$unmapped.pod_namespace$,$unmapped.pod_name$,$unmapped.src_edl$,$unmapped.dst_edl$,$unmapped.hostid$,$unmapped.serialnumber$,$unmapped.src_dag$,$unmapped.dst_dag$,$time$,$unmapped.reason$"
          halt: true,
          rewrites: [
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Critical$",
                  replace: "5"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^High$",
                  replace: "4"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Medium$",
                  replace: "3"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Low$",
                  replace: "2"
              },
              {
                  input:   "unmapped.severity",
                  output:  "severity_id",
                  match:   "^Informational$",
                  replace: "1"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^allow$",
                  replace: "1"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^deny$",
                  replace: "2"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^(?!allow|deny$).*",
                  replace: "99"
              },
              {
                  input:   "message",
                  output:  "resources",
                  match:   "(.*?) (.*?) (.*?) (.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?).*",
                  replace: "\\[\\{\"owner\"\\: \\{\"name\"\\: \"$15\"\\, \"groups\": \\[\\{\"name\"\\: \"$68\"\\}\\]\\}\\, \"data\"\\: \\{\"src_ip\"\\: \"$10\"\\, \"dst_ip\"\\: \"$11\"\\, \"src_nat_ip\"\\: \"$12\"\\, \"dst_nat_ip\"\\: \"$13\"\\, \"dest_user\"\\: \"$16\"\\, \"src_port\"\\: \"$26\"\\, \"dst_port\"\\: \"$27\"\\, \"src_nat_port\"\\: \"$28\"\\, \"dst_nat_port\"\\: \"$29\"\\, \"src_country\"\\: \"$37\"\\, \"dst_country\"\\: \"$38\"\\, \"device_name\"\\: \"$53\"\\, \"xff_ip\"\\: \"$69\"\\, \"src_host\"\\: \"$76\"\\, \"src_mac\"\\: \"$77\"\\, \"dst_host\"\\: \"$84\"\\, \"dst_mac\"\\: \"$85\"\\}\\}\\]"
              },
          ]
      },
      {
          attributes: {
              "metadata.log_name": "CONFIG",
              "class_uid": "6003",
              "activity_id": "99",
              "activity_name": "CONFIG",
              "event.type": "CONFIG",
              "category_uid": "6",
              "type_uid": "600399",
              "severity_id": "0",
              "class_name": "API Activity",
              "type_name": "API Activity: Other",
              "category_name": "Application Activity",
              "metadata.product.name": "Prisma Access",
              "metadata.product.vendor_name": "Palo Alto Networks",
          },
          format: "$metadata.processed_time$ $unmapped.header$ .* $metadata.logged_time$,$unmapped.serial$,CONFIG,$api.operation$,$metadata.product.version$,$metadata.original_time$,$src_endpoint.ip$,$unmapped.vsys$,$unmapped.action$,$actor.user.name$,$unmapped.client$,$status_detail$,$unmapped.config_path$,$metadata.sequence$,$unmapped.dg_hier_level_1$,$unmapped.dg_hier_level_2$,$unmapped.dg_hier_level_3$,$unmapped.dg_hier_level_4$,$unmapped.vsys_name$,$src_endpoint.name$,$unmapped.device_group$,$unmapped.comment$,.*,$time$",
          halt: true, 
          rewrites: [
              {
                  input:   "message",
                  output:  "observables",
                  match:   "(.*?) (.*?) (.*?) (.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?).*",
                  replace: "\\[\\{\"type_id\"\\: \"3\"\\, \"type\"\\: \"User Name\"\\, \"name\"\\: \"actor.user.name\"\\, \"value\"\\: \"$13\"\\}\\]"
              },
          ]     
      },
      {
          attributes: {
              "metadata.log_name": "SYSTEM",
              "class_uid": "6003",
              "activity_id": "99",
              "category_uid": "6",
              "type_uid": "600399",
              "severity_id": "0",
              "class_name": "API Activity",
              "type_name": "API Activity: Other",
              "category_name": "Application Activity",
              "metadata.product.name": "Prisma Access",
              "metadata.product.vendor_name": "Palo Alto Networks",
          },
          format: "$metadata.processed_time$ $unmapped.header$ .* $metadata.logged_time$,$unmapped.serial$,SYSTEM,$api.operation$,$metadata.product.version$,$metadata.original_time$,$unmapped.vsys$,$metadata.event_code$,$unmapped.object$,$unmapped.severity$,$api.response.message$,$metadata.sequence$,$unmapped.dg_hier_level_1$,$unmapped.dg_hier_level_2$,$unmapped.dg_hier_level_3$,$unmapped.dg_hier_level_4$,$unmapped.vsys_name$,$src_endpoint.name$,.*,.*,$time$",
          halt: true,
          rewrites: [
              {
                  input:   "api.operation",
                  output:  "activity_name",
                  match:   ".*",
                  replace: "$0"
              },
              {
                  input:   "api.operation",
                  output:  "event.type",
                  match:   ".*",
                  replace: "$0"
              },
          ]   
      },
      {
          attributes: {
              "metadata.log_name": "DECRYPTION"
              "class_uid": "4001",
              "activity_id": "1",
              "activity_name": "Open",
              "event.type": "Open",
              "unmapped.sub_type": "start"
              "category_uid": "4",
              "type_uid": "400101",
              "severity_id": "0",
              "class_name": "Network Activity",
              "category_name": "Network Activity",
              "type_name": "Network Activity: Open",
              "metadata.product.name": "Prisma Access",
              "metadata.product.vendor_name": "Palo Alto Networks",
          },
          format: "$metadata.processed_time$ $unmapped.header$ .* $metadata.logged_time$,$device.hw_info.serial_number$,DECRYPTION,start,$metadata.product.version$,$metadata.original_time$,$src_endpoint.ip$,$dst_endpoint.ip$,$src_endpoint.intermediate_ips$,$dst_endpoint.intermediate_ips$,$unmapped.rule_matched$,$actor.user.name$,$unmapped.dest_user$,$app_name$,$unmapped.vsys$,$unmapped.from_zone$,$unmapped.to_zone$,$unmapped.inbound_if$,$unmapped.outbound_if$,$metadata.log_provider$,$metadata.original_time$,$actor.session.uid$,$count$,$src_endpoint.port$,$dst_endpoint.port$,$unmapped.src_nat_port$,$unmapped.dst_nat_port$,$connection_info.protocol_name$,$unmapped.action$,$unmapped.tunnel_type$,$unmapped.src_uuid$,$unmapped.dst_uuid$,$unmapped.rule_matched_uuid$,$unmapped.hs_stage_c2f$,$unmapped.hs_stage_f2s$,$tls.version$,$unmapped.tls_key_exchnage$,$unmapped.tls_encrypt_algorithm$,$unmapped.tls_auth_alogorithm$,$unmapped.policy_name$,$unmapped.elliptic_cryptography_curve$,$unmapped.error_index$,$unmapped.root_status$,$unmapped.chain_status$,$unmapped.proxy_type$,$tls.certificate.serial_number$,$tls.certificate.fingerprint$,$tls.certificate.created_time$,$tls.certificate.expiration_time$,$tls.certificate.version$,$tls.key_length$,$unmapped.cn_len$,$unmapped.issuer_len$,$unmapped.rootcn_len$,$unmapped.sni_len$,$unmapped.cert_flags$,$tls.certificate.subject$,$tls.certificate.issuer$,$unmapped.root_cn$,$tls.sni$,$status_detail$,$unmapped.container_id$,$unmapped.pod_namespace$,$unmapped.pod_name$,$unmapped.src_edl$,$unmapped.dst_edl$,$unmapped.src_dag$,$unmapped.dst_dag$,$time$,$unmapped.src_category$,$unmapped.src_profile$,$unmapped.src_model$,$unmapped.src_vendor$,$unmapped.src_osfamily$,$unmapped.src_osversion$,$src_endpoint.hostname$,$src_endpoint.mac$,$unmapped.dst_category$,$unmapped.dst_profile$,$unmapped.dst_model$,$unmapped.dst_vendor$,$unmapped.dst_osfamily$,$unmapped.dst_osversion$,$dst_endpoint.hostname$,$dst_endpoint.mac$,$metadata.sequence$",
          halt: true,  
          rewrites: [
              {
                  input:   "dst_endpoint.intermediate_ips",
                  output:  "dst_endpoint.intermediate_ips",
                  match:   ".*",
                  replace: "\\[\"$0\"\\]"
              },
              {
                  input:   "src_endpoint.intermediate_ips",
                  output:  "src_endpoint.intermediate_ips",
                  match:   ".*",
                  replace: "\\[\"$0\"\\]"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^allow$",
                  replace: "1"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^deny$",
                  replace: "2"
              },
              {
                  input:   "unmapped.action",
                  output:  "status_id",
                  match:   "^(?!allow|deny$).*",
                  replace: "99"
              },
              {
                  input:   "message",
                  output:  "observables",
                  match:   "(.*?) (.*?) (.*?) (.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?),(.*?).*",
                  replace: "\\[\\{\"type_id\"\\: \"1\"\\, \"type\"\\: \"Hostname\"\\, \"name\"\\: \"src_endpoint.hostname\"\\, \"value\"\\: \"$79\"\\}\\, \\{\"type_id\"\\: \"1\"\\, \"type\"\\: \"Hostname\"\\, \"name\"\\: \"dst_endpoint.hostname\"\\, \"value\"\\: \"$87\"\\}\\, \\{\"type_id\"\\: \"2\"\\, \"type\"\\: \"IP Address\"\\, \"name\"\\: \"src_endpoint.ip\"\\, \"value\"\\: \"$10\"\\}\\, \\{\"type_id\"\\: \"2\"\\, \"type\"\\: \"IP Address\"\\, \"name\"\\: \"dst_endpoint.ip\"\\, \"value\"\\: \"$11\"\\}\\, \\{\"type_id\"\\: \"3\"\\, \"type\"\\: \"MAC Address\"\\, \"name\"\\: \"src_endpoint.mac\"\\, \"value\"\\: \"$80\"\\}\\, \\{\"type_id\"\\: \"3\"\\, \"type\"\\: \"MAC Address\"\\, \"name\"\\: \"dst_endpoint.mac\"\\, \"value\"\\: \"$88\"\\}\\, \\{\"type_id\"\\: \"4\"\\, \"type\"\\: \"User Name\"\\, \"name\"\\: \"actor.user.name\"\\, \"value\"\\: \"$15\"\\}\\, \\{\"type_id\"\\: \"4\"\\, \"type\"\\: \"User Name\"\\, \"name\"\\: \"unmapped.dest_user\"\\, \"value\"\\: \"$16\"\\}\\]"
              },
          ]      
      },
  ]    
}        